{
  "transactions-management": "#  Managing Your Transactions\n\nThis page is your detailed, searchable log of every financial activity. Keeping it up-to-date is the key to unlocking the full power of Expense Pro's analysis features. It shows a comprehensive table of all your transactions from all accounts by default.\n\n\n\nClick the **\"Add Transaction\"** button. A modal will appear where you can choose **Expense** or **Income**, then fill in the details:\n\n- **Description:** What the transaction was for (e.g., \"Groceries at SuperMart\").\n- **Amount:** The monetary value.\n- **Account:** Which of your accounts was used.\n- **Category:** Assign a category for spending analysis (e.g., \"Food\").\n- **Date:** The date the transaction occurred.\n\n\n\n\n  In the transaction list, use the actions menu (...) on the right of each row. From there you can\n  choose to **Edit** any detail in a modal or **Delete** the transaction permanently.\n\n\n\n\nUse the powerful controls at the top of the list to find exactly what you need:\n\n- **Search Bar:** Instantly find transactions by text in their description.\n- **Filters Button :** Open a dialog to filter by Account, Category, Type (Income/Expense), Date Range, and Amount Range. Active filters are shown as badges above the table.\n- **Export Button :** Export the currently filtered data to an Excel (.xlsx) or CSV file.\n\n\n\n\n  Want to see how much you spent on \"Groceries\" from your \"Main Checking\" account last month?\n  Combining filters makes this possible in seconds. The exported file will respect your active\n  filters.",
  "ai-assistant-setup": "#  Setting Up Your AI Provider for Privacy\n\nFor maximum user privacy and control, the AI Assistant is powered by **your own personal API key** from a provider of your choice. This \"Bring Your Own Key\" (BYOK) model means your financial data is sent from our secure server directly to the AI provider you trust, using your key. We never see or log your raw API key.\n\n\n  Go to your **Profile** by clicking your user icon in the bottom-left of the sidebar. From there,\n  select the **AI Assistant** tab to begin the setup.\n\n\n\n\n- **Select an AI Provider:** Use the dropdown to choose your preferred service (e.g., Google, OpenAI, Anthropic).\n- **Select a Model:** Based on your provider, a list of available models will appear. Choose the one you'd like to use.\n\n\n\n\n  Each provider has a section on their website for generating API keys. Click the link on the\n  settings page to go directly to your chosen provider's key management page, create a key, and\n  paste it into the \"API Key\" input field.\n\n\n\n  You can fine-tune the AI's behavior by adjusting the **Temperature** or provider-specific settings\n  like **Google Safety Settings**. Once you're done, click **Save Settings**. The AI Assistant will\n  be enabled immediately across the app.\n\n\n\n  Your API key is stored securely in our database using strong AES-GCM encryption. It is only ever\n  decrypted on the server when needed to process your AI requests on your behalf.",
  "accounts": "import AccountsListing from './accounts-listing.mdx';\nimport AccountsDetails from './accounts-details.mdx';\nimport AccountsSharing from './accounts-sharing.mdx';\nimport AccountsStatement from './accounts-statement.mdx';\n\n\n  Managing Your Accounts\n\nThis section covers everything related to managing the financial accounts you track in Expense Pro, from creation to secure collaboration. An \"account\" can be a bank account, credit card, digital wallet, or even a stash of cash.\n\n<AccountsListing />\n<AccountsDetails />\n<AccountsSharing />\n<AccountsStatement />",
  "ai-assistant": "import AiAssistantSetup from './ai-assistant-setup.mdx';\nimport AiAssistantUsage from './ai-assistant-usage.mdx';\n\n\n  The AI Assistant\n\nThe AI Assistant is your conversational finance expert, designed to make managing your money as simple as sending a text. You can access it by clicking on **\"AI Assistant\"** in the main sidebar under the \"Intelligence\" section. This will take you to a full-page chat interface where you can ask questions, add transactions, and get insights using natural language.\n\n<AiAssistantSetup />\n<AiAssistantUsage />",
  "ai-assistant-usage": "#  How to Use the AI Assistant\n\nOnce your key is set up, you can open the AI Assistant from the main sidebar or by clicking the floating chat bubble in the bottom-right corner of most pages. If you don't have a key, the AI Chat page will guide you to your profile to add one.\n\n\n\nYou can ask complex questions about your finances, and the AI will query your data to find the answer. For example:\n\n- \"What was my total spending last month?\"\n- \"How much did I spend on groceries in June?\"\n- \"Show me my highest expense this year.\"\n\n\n\n\n\nSimply type what you did, and the AI will understand and pre-fill the transaction form for you. For example:\n\n- \"Add an expense of 75 for a coffee at CCD\"\n- \"I received my 5000 salary today\"\n\n\n\n\n\nThe AI can generate charts on the fly to help you understand your data. Try asking:\n\n- \"Show a pie chart of my spending this month.\"\n- \"Give me a bar chart of my income vs expenses for the last 6 months.\"\n\nThe AI will render the chart directly in the chat window.\n\n\n\n\n\nDrag and drop a file or click the paperclip icon  to have the AI analyze it: - **Receipts\n(Images):** Upload a photo of a receipt, and the AI will extract the details and queue it up as a\ntransaction. - **Bank Statements (PDF/XLSX):** Upload a statement. The AI will analyze it, extract\nall transactions, and present them for you to review and import in a single click. This is a massive\ntime-saver!",
  "accounts-statement": "#  Generating Statements\n\nNeed a professional-looking statement for your records or to share? You can generate one for any account from the dedicated Statement page.\n\nThis page allows you to create and download a PDF or Excel statement for a specific account based on a date range or the number of recent transactions.\n\n\n  Use the dropdown menu to choose the account for which you want to generate a statement. The date\n  picker will automatically adjust to the range of available transaction dates for that account.\n\n\n\n\nYou have two ways to define what the statement includes:\n\n- **By Date Range:** Use the date picker to select a specific start and end date.\n- **By Latest Transactions:** Enter a number (e.g., 100) to get a statement of the most recent transactions.\n\nYou can also use the quick-select presets for common periods like \"This Month,\" \"Last Month,\" \"This Year,\" or \"Last Year.\"\n\n\n\n\n  Select either **PDF** for a professionally formatted, printable document or **XLSX** for a raw\n  data file compatible with spreadsheet software like Excel or Google Sheets.\n\n\n\n  Click the **\"Generate Statement\"** button. Your file will be generated and downloaded\n  automatically.\n\n\n\n  The PDF statements are cleanly formatted with your account details and a clear transaction\n  history, suitable for official use such as for accounting or loan applications.",
  "accounts-sharing": "#  Account Sharing & Collaboration\n\nSecurely share specific accounts with a partner, accountant, or family member without giving them access to your entire profile. This feature is split into two key areas: sharing your accounts and viewing accounts shared with you.\n\n\n  Managing Who You Share With\n\nWhen you are the owner of an account, you have full control over who can see it.\n\n\n\nFrom the **Account Details** page, click the **Share Account**  icon. You will be prompted to enter the email address of the user you wish to invite. They will receive an email notification to accept the invitation.\n\n\n\n\n\nNavigate to the **Account Shares** page by clicking the **View Shares**  button on the Account Details page. Here, you can see a list of everyone who has access, including their name and email. As the owner, you can **Revoke** their access at any time using the dropdown menu on their card.\n\n\n\n\n  Viewing Accounts Shared With You\n\nThis page provides a dedicated space to see all the financial accounts that other Expense Pro users have granted you access to.\n\n\n\nClick on **\"Shared Accounts\"** in the main sidebar under the \"Manage\" section. This keeps accounts others share with you separate from your personal accounts for privacy and clarity.\n\n\n\n\n\nEach shared account is displayed as a card, showing its name, the owner's name, and the current balance. You can search for specific accounts and click on any card to navigate to its **Account Details** page, where you can view its transactions and analytics in a read-only mode.",
  "data-management": "import TransactionsImport from './transactions-import.mdx';\nimport AccountsStatement from './accounts-statement.mdx';\nimport DataExport from './data-export.mdx';\n\n\n  Data Import & Export\n\nExpense Pro gives you full control over your financial data. Whether you're bringing in years of history or exporting records for tax season, these tools make it simple.\n\n<TransactionsImport />\n<AccountsStatement />\n<DataExport />",
  "transactions-import": "#  Importing Data\n\nThis is the fastest way to get your historical data into the app. The import wizard is a step-by-step process to upload a file and bulk-add your transaction history from a bank or another software.\n\n\n\n- **Select Account:** First, choose the destination account for the imported transactions from the\n  dropdown menu.\n- **Provide File:** Drag and drop your file onto the upload area, or click to\n  browse. The system can process Excel files and, with AI, can often read PDF bank statements.\n\n\n\n\n  \n- **Excel (XLSX):** For the most reliable results, **download the Excel template** from the import\n  page. This ensures all your data columns are mapped correctly. - **PDF:** If you have a standard\n  bank statement, the AI can often read it automatically. If the PDF is password-protected, you will\n  be prompted to enter the password. This is a massive time-saver!\n\n\n\n\n\nAfter processing, a preview dialog will appear showing all the transactions extracted from your file.\n\n- **Review:** Check the data for accuracy.\n- **Select:** Use the checkboxes to select only the transactions you wish to import. By default, all are selected. Uncheck any duplicates or unwanted entries.\n- **Confirm:** Click **\"Confirm and Stage\"** to move to the final step.\n\n\n\n\n  A final confirmation dialog will appear summarizing the number of transactions you are about to\n  import. Click **\"Import Transactions\"** to permanently add them to your selected account. You will\n  see a success message upon completion.",
  "getting-started": "Getting Started\n\nWelcome aboard! This guide will walk you through the essential first steps to set up your Expense Pro account and begin your journey to financial clarity. Let's get you up and running in minutes.\n\n\n# Signing Up & Your First Login\n\nCreating your Expense Pro account is the first step. It's simple and secure. You can start by visiting the signup page.\n\n\n  Provide your full name, a valid email address, and create a strong, unique password (minimum 8\n  characters). You can also add a profile picture to personalize your account by clicking the\n  **\"Upload\"** button.\n\n\n\n  After clicking **\"Create Account,\"** we'll send a 6-digit One-Time Password (OTP) to your email.\n  Check your inbox (and spam folder, just in case) and enter this code on the verification screen to\n  activate your account and log in for the first time.\n\n\n\n# Creating Your First Financial Account\n\nAn \"Account\" in Expense Pro is a digital mirror of a real-world place where you manage money (like a bank account or credit card). To track anything, you first need at least one account. After your first login, you will be directed to the Accounts page to create one.\n\n\n  Click the **\"Add Account\"** button to open the new account form.\n\n\n\n\n- **Account Name:** Give it a clear, recognizable name, like \"HDFC Savings Account\" or \"Amex Credit Card\".\n- **Starting Balance:** This is a crucial step. Enter the **current, actual balance** of that account as of today.\n- **Currency:** Select the correct currency for this account from the dropdown.\n\n\n\n\n  For the most accurate financial picture, create an account in Expense Pro for every real-world\n  account you use to spend or receive money—including bank accounts, credit cards, digital wallets,\n  and even physical cash.\n\n\n\n# Understanding the Layout\n\nThe app is designed for simplicity and power.\n\n\n  Your primary navigation hub on the left. It's organized into logical groups: **Overview**,\n  **Manage**, and **Planning**. You can collapse it to an icon-only view by clicking the toggle\n  button at the bottom.\n\n\n\n  The bar at the top of the main content area displays your current location using **breadcrumbs**\n  (e.g., `Accounts / My Savings Account`). You can click on any part of the breadcrumb path to\n  navigate back. It also contains the light/dark mode toggle.\n\n\n\n  In the bottom-right corner, you'll find floating buttons for quick access to the **AI Assistant**{' '}\n   and **Contextual Help**{' '}\n  .\n\n\n\n  We love efficiency! Press Ctrl + B (or ⌘{' '}\n  + B on Mac) to quickly show or hide the sidebar at any time.",
  "planning-investments": "#  Investments\n\nConsolidate and monitor your entire investment portfolio in one place. This feature allows you to track stocks, mutual funds, and other assets from different brokerage accounts to get a unified view of your portfolio's performance.\n\n\n  Investment Accounts Page\n\nThis is the main page where you manage the containers for your investments. An \"Investment Account\" in the app represents a real-world brokerage account (e.g., \"Zerodha Equity\", \"Groww Mutual Funds\").\n\n\n  Click the **\"Add New Account\"** button. You'll need to provide a **Name**, the **Platform/Broker**\n  (e.g., Fidelity, Vanguard), and the **Currency**.\n\n\n\n  Each investment account is shown on a card with key metrics: **Total Invested**, **Current\n  Value**, and **Overall Profit/Loss**. This gives you a high-level snapshot of each portfolio's\n  health. Click on a card to drill down into its details.\n\n\n\n  Investment Account Detail Page\n\nThis page provides a deep dive into a single investment account.\n\n\n  The top of the page features an overview with key performance indicators (KPIs) and a chart\n  showing your portfolio's value over time. You can adjust the time range for the chart to see\n  short-term or long-term performance.\n\n\n\n\nThe main part of the page is the **Holdings** table, which lists every individual asset (stock, fund, etc.) within that account.\n\n- **Add Holding:** Click the **\"Add Investment\"** button to add a new asset. You can search for stocks by symbol, and the app can fetch the current price for you.\n- **Manage Holdings:** Use the action menu on each holding to **Edit** its details (quantity, purchase price) or **Delete** it from your portfolio.",
  "planning": "import PlanningBudgets from './planning-budgets.mdx';\nimport PlanningGoals from './planning-goals.mdx';\nimport PlanningInvestments from './planning-investments.mdx';\nimport PlanningDebts from './planning-debts.mdx';\n\n\n  Planning Features\n\nGo beyond tracking the past. Use these tools to proactively plan your financial future and turn your goals into reality.\n\n<PlanningBudgets />\n<PlanningGoals />\n<PlanningInvestments />\n<PlanningDebts />",
  "profile-settings": "Profile & Settings\n\nThis section is your personal space to customize your account, manage security, and control application settings. You can access it by clicking your user icon in the bottom-left of the sidebar, then selecting \"Profile\".\n\nThe page is organized into four tabs for clarity.\n\n\n#  Profile Tab\n\nThis is where you manage your personal information.\n\n\n  Here you can change your **Full Name** and update your **Profile Picture**. Click the camera icon{' '}\n   on your avatar to upload a new image.\n\n\n\n  Your **Preferred Currency** is a crucial setting. It affects how aggregated totals and reports are\n  displayed throughout the app, especially on the Dashboard. Choose the currency that you use for\n  your primary financial thinking.\n\n\n\n#  Security Tab\n\nManage your account security here.\n\n\n  To update your password, you'll need to enter your **current password** first for verification,\n  followed by your new password in the next two fields to confirm it.\n\n\n\n  At the bottom of this section is the option to permanently delete your account. This action will\n  erase all of your data from Expense Pro.\n\n\n\n  When you delete your account, all associated accounts, transactions, budgets, and goals are\n  permanently erased. This data **cannot be recovered**. Please be absolutely sure before\n  proceeding.\n\n\n\n#  Notifications Tab\n\nControl how and when we contact you. You can use the master **\"Enable All Notifications\"** switch, or individually toggle email alerts for important events related to your Budgets, Goals, and upcoming Bills.\n\n\n#  AI Assistant Tab\n\nThis is where you configure the AI that powers your assistant. You can select your preferred **AI Provider** (like Google or OpenAI), choose a specific **Model**, and securely save your personal **API Key**. You can also adjust advanced options like **Temperature** to fine-tune the AI's creativity. If you don't have a key, this section will guide you on how to get one from your chosen provider.",
  "planning-budgets": "#  Budgets\n\nBudgets are your primary tool for controlling spending and ensuring your money goes where you want it to. You can create monthly or yearly budgets for any spending category.\n\nOn this page, you can see a table of all your created budgets, search them by name, and see their details at a glance.\n\n\n\nClick the **\"Add Budget\"** button. In the modal, you will need to specify:\n\n- **Category:** The spending category this budget applies to (e.g., \"Dining Out\").\n- **Amount:** The maximum amount you want to spend in this category.\n- **Month and Year:** The period this budget is for.\n\n\n\n\n  The app automatically tracks your spending in that category against the budget you set. In the\n  budget list, you can see the budgeted amount, the actual amount spent, and the remaining balance.\n  The main Dashboard also features a \"Budget Progress\" widget for a quick visual summary of how\n  you're doing.\n\n\n\n  Use the action menu on the right of each budget in the table to **Edit** its amount or **Delete**\n  it.",
  "accounts-listing": "#  The Main Accounts List\n\nThis is your central hub for viewing all your financial accounts at a glance. Each account is displayed on a card showing its current **Balance**, and a summary of its recent activity, giving you a quick check on its health.\n\nThe page includes a search bar to quickly find accounts by name and pagination if you have a large number of accounts.\n\n\n\nClick the **\"Add Account\"** button. You'll need to provide a name (e.g., \"ICICI Savings\"), its\ncurrent starting balance, and the currency. You can also set an account as the \"default\" account,\nwhich may be pre-selected in other parts of the application.\n\n\n\n\n\nThe **\"Add Transaction\"** button at the top of the page lets you quickly record an income or\nexpense without needing to navigate to the full transactions page first.\n\n\n\n\n\nHover over any account card to reveal quick action buttons:\n\n- **Edit :** Opens a modal to update the account's name.\n- **Delete :** Opens a confirmation dialog to delete the account.\n\n\n\n\n\nDeleting an account will also permanently erase **all of its associated transactions, budget\nlinks, and goal contributions**. This action cannot be undone. Please be absolutely certain before\nyou confirm.",
  "planning-goals": "#  Goals\n\nGive your savings a clear purpose and stay motivated by watching your progress. This page helps you set up and track savings goals for anything from a new gadget to a major life event.\n\n\n\nClick **\"Add Goal\"** and fill in the details:\n\n- **Name:** A clear name for your goal (e.g., \"New Laptop\" or \"Vacation to Japan\").\n- **Target Amount:** The total amount of money you need to save.\n- **Target Date:** An optional date by which you hope to achieve the goal.\n- **Starting Amount:** Any amount you have already saved towards this goal.\n\n\n\n\n\nThe main table shows all your goals, their targets, how much you've saved, and a progress bar for quick visualization. Use the action menu on the right of each goal to:\n\n- **Add Amount:** Log a new contribution towards your goal.\n- **Withdraw Amount:** Record any money taken out from your savings for that goal.\n- **Edit Goal:** Modify the goal's name, target amount, or date.\n- **Delete Goal:** Permanently remove the goal.\n\n\n\n\n  Your most important goals will also appear on the main **Dashboard** in the \"Goal Highlights\" card\n  to keep you focused and motivated every time you log in.",
  "transactions": "import TransactionsManagement from './transactions-management.mdx';\nimport TransactionsImport from './transactions-import.mdx';\n\n\n  Transactions\n\nThe Transactions page is the heart of your financial record-keeping. It's a detailed, searchable log of every financial activity you've recorded across all your accounts.\n\n\n  Keeping your transactions up-to-date is the key to unlocking the full power of Expense Pro's\n  analysis and budgeting features.\n\n\n<TransactionsManagement />\n<TransactionsImport />",
  "dashboard": "The Dashboard\n\nThe Dashboard is your financial mission control. It consolidates data from all your accounts to give you a comprehensive, real-time overview of your entire financial situation. This is the first page you see after logging in, providing a high-level summary of your finances.\n\n\n#  Financial Snapshot\n\nThis widget provides your most critical financial vital signs at a glance. It shows the total sum of all your account balances, giving a clear indicator of your liquid net worth. It also displays total income and expenses for the selected period, alongside a mini-chart visualizing your balance trend.\n\n\n#  Quick Stats\n\nThis card pinpoints your single **Highest Income**, **Lowest Income**, **Highest Expense**, and **Lowest Expense** events, helping you notice significant financial activities instantly. It also shows a breakdown of transaction counts per account, so you can see which accounts are most active.\n\n\n#  Financial Health\n\nThis isn't just a number; it's an AI-powered assessment of your financial wellness based on factors like your spending habits, savings rate, and debt-to-income ratio. A higher score indicates stronger financial habits.\n\n\n  Click the **\"View Full Analysis\"** button to receive a detailed, AI-generated report on your\n  financial strengths, areas for improvement, and actionable recommendations to boost your score.\n\n\n\n#  Financial Trends Chart\n\nThis powerful chart visualizes the rhythm of your finances over time, showing the interplay between your income, expenses, and overall balance.\n\n\n  Use the date range picker at the top of the chart to select a period. You can choose presets like\n  \"This Month\" or select a custom range. The entire dashboard will update to reflect this period.\n\n\n\n  You can switch between **Line**, **Bar**, and **Area** chart views using the toggle buttons to\n  find the visualization that tells your story best. Hover over the chart to see detailed figures\n  for any specific day.\n\n\n\n#  Spending Breakdown\n\nThis chart is crucial for answering the question: \"Where is my money _really_ going?\" It aggregates all your expenses for the selected period, groups them by category, and displays the proportion of your spending for each. This is essential for identifying areas where you can cut back. You can switch between **Pie**, **Donut**, and **Column** views.\n\n\n#  Budget Progress\n\nThis widget shows you how you're tracking against the budgets you've set for the current month. Each bar represents a budget for a specific category, visually showing how much you've spent versus how much you allocated.\n\n\n#  Goal Highlights\n\nStay motivated by seeing your top savings goals right on the dashboard. This card displays the progress you've made towards achieving your most important financial objectives.\n\n\n#  Debt Summary\n\nGet a quick overview of your liabilities. This card shows a summary of money you've borrowed (taken) and money you've lent out (given), helping you stay on top of what you owe and what's owed to you.\n\n\n#  Investment Summary\n\nThis provides a high-level look at your investment portfolio's performance, showing total invested capital versus the current market value.\n\n\n#  Accounts Summary\n\nThis card lists your financial accounts, showing the current balance for each one. It's a quick way to check the status of individual accounts without leaving the dashboard.",
  "accounts-details": "#  The Account Details Page\n\nClicking on any account card from the list takes you to its dedicated detail page for an in-depth analysis. All charts, stats, and the transaction list on this page are filtered to show data _only_ for the selected account.\n\n\n  \n  The **Analytics Cards** and **Financial Trends** chart at the top of the page are specific to this account. This is perfect for deep-diving into the performance and history of a single account without the noise of others. The trends chart shows income, expenses, and balance over time, and you can adjust the duration (e.g., 7 days, 30 days, 1 year).\n\n\n\n\n\nAt the top of the page, you'll find a set of powerful tools specific to this account:\n\n- **Share Account :** Invite another user to view this account's data by entering their email.\n- **View Shares :** See and manage who you have already shared this account with.\n- **Generate Statement :** Go to the dedicated page to generate a formal PDF or XLSX statement for your records.\n\n\n\n\n\nThe lower section of the page contains a complete, searchable list of all transactions associated with this account. You can add, edit, or delete transactions directly from here, and the changes will be reflected in the account's analytics instantly.",
  "planning-debts": "#  Debts\n\nGet a clear, centralized view of all your liabilities, whether you've borrowed money or lent it to someone else. This page helps you manage personal loans, credit card debt, and money you've lent to others.\n\n\n  At the top of the page, you can filter the list to show all debts, only money you have **Given**,\n  or only money you have **Taken**. You can also use the search bar to find a specific debt by its\n  description or the counterparty involved.\n\n\n\n  Click **\"Add Debt\"** and specify whether you have **Taken** (borrowed) or **Given** (lent) the\n  money. Record the principal amount, interest rate, term, and the other party involved. This\n  creates a new entry in the table.\n\n\n\n\nThe main table lists all your debts with their key details. Use the action menu on the right of each debt to:\n\n- **Edit:** Modify the details of the debt.\n- **Delete:** Permanently remove the debt record.\n- **Mark as Paid:** Settle a debt, which will update its status.\n\n\n\n\n  Not sure about the terms of a potential loan? Before creating a debt record, click the\n  **\"Calculator\"** button. This opens a modal where you can model different scenarios (amount,\n  interest rate, term) and see the total interest you would pay. You can then use these calculated\n  values to pre-fill the \"Add Debt\" form.",
  "data-export": "#  Exporting Your Data\n\nIt's your data. Export it anytime for offline analysis, accounting, or personal records.\n\n\n  The export functionality lives on the main **Transactions** page, as it allows you to first filter\n  the exact data you need.\n\n\n\n  Use the powerful filtering options at the top of the page to narrow down the data. You can filter\n  by date range, account, category, and more. This ensures your exported file contains only the\n  relevant information. For example, you could filter for all \"Business\" expenses from the last\n  financial year.\n\n\n\n\nOnce your filters are applied, click the **\"Export\"** button. You will be given a choice of two formats:\n\n- **Excel (.xlsx):** Best for use in spreadsheet software like Excel or Google Sheets.\n- **CSV (.csv):** A universal plain-text format compatible with nearly any data tool."
}
